# 1.Pivot

### Create DataFrame from csv

In [1]:
# change current working directory to where the files are available 
import os
print(os.getcwd())
os.chdir("E:/code/5.DataAnalysisOfficial/data/pandas")
print(os.getcwd())

E:\code\5.DataAnalysisOfficial
E:\code\5.DataAnalysisOfficial\data\pandas

In [2]:
# 01. import required modules and load data
import pandas as pd

df = pd.read_csv("pandas_users.csv")
df

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

### 1.1 pivot data with one metric(visitors / signups)
- Return reshaped DataFrame organized by given index / column values.

#### df.pivot?
- Signature: df.pivot(index=None, columns=None, values=None)
- Docstring: Return reshaped DataFrame organized by given index / column values.

In [3]:
# 02. weekday and city wise, Number of visitors
df.pivot(index="weekday", columns="city", values="visitors")

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

In [4]:
# 03. weekday and city wise, Number of signups
df.pivot(index="weekday", columns="city", values="signups")

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12

In [5]:
df.pivot(index="city", columns="weekday", values="signups")

weekday  Mon  Sun
city
Austin     3    7
Dallas     5   12

### 1.2. Pivot data with all metrics

In [7]:
# 04.weekday and city wise, number of visitors and signups
df.pivot(index="weekday", columns="city", values=["visitors","signups"])

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

In [8]:
df.pivot(index="weekday", columns="city")

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

### 2.Stack and unStack
- Stack is useful to work with multi-level index

#### df.stack?
- Signature: df.stack(level=-1, dropna=True)
- Docstring: Stack the prescribed level(s) from columns to index.

In [12]:
#01. import required modules and load data
import pandas as pd
df = pd.read_csv("pandas_users.csv")
df

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [13]:
#02. set multi level index
df = df.set_index(['city','weekday'])
df

                visitors  signups
city   weekday
Austin Sun           139        7
Dallas Sun           237       12
Austin Mon           326        3
Dallas Mon           456        5

In [15]:
#03. by week day
unstack_df = df.unstack(level = 'weekday')
unstack_df

        visitors      signups
weekday      Mon  Sun     Mon Sun
city
Austin       326  139       3   7
Dallas       456  237       5  12

In [16]:
# 04.  revert it
df1 = unstack_df.stack(level = 'weekday')
df1

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

#### df.pivot_table?
- Signature: df.pivot_table(values=None, index=None, columns=None, aggfunc='mean',
                          fill_value=None, margins=False, dropna=True, margins_name='All')
- Docstring: Create a spreadsheet-style pivot table as a DataFrame. The levels in the pivot table will be stored 
           in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame